// import { db } from '@vercel/postgres';
import { NextApiRequest, NextApiResponse } from 'next';
// import { faker } from '@faker-js/faker/locale/uk';
// import { title } from 'process';

export interface DementiaMenu {
	menuTitle: string;
	id: number;
	shortContent: string;
	linkUrl: string;
	contentLight: string;
	contentDark: string;
	menuSubTitle: SubMenu[];
}

export interface SubMenu {
	SubMenuId: number;
	SubMenuTitle: string;
	SubMenuLinkUrl: string;
	SubMenuCards: SubMenuCard[];
}

export interface SubMenuCard {
	cardTitle: string;
	cardId: number;
	cardLinkUrl: string;
	cardImg: string;
	cardText: cardText[];
	cardIntroduction: string;
	cardIntroductionTitle: string;
}
interface cardText {
	cardTextId: number;
	cardTextTitle: string;
	cardTextDescription: string;
}

const dementiaMenu: DementiaMenu[] = [
	{
		menuTitle: 'Що таке деменція?',
		id: 1,
		shortContent:
			'Що таке деменція, як поставити діагноз і як зменшити ризик розвитку деменції або відстрочити її вплив.',
		linkUrl: '/Що таке деменція',
		contentLight: `Кожна людина час від часу може щось забувати, і зазвичай це нормально. Але якщо проблеми з пам’яттю впливають на ваше повсякденне життя, краще звернутися до лікаря загальної практики.

        Втрата пам'яті є однією з поширених ознак деменції, яка виникає унаслідок захворювань, що пошкоджують роботу мозку. Це пошкодження часто вражає ділянки мозку, які беруть участь у створенні нових спогадів і запам’ятовуванні старих. Однак деменція може проявлятися й через інші симптоми, що можуть виникати раніше за погіршення пам'яті, зокрема дезорієнтація, депресія тощо.`,
		contentDark: `Погіршення пам’яті не обов’язково означає, що у вас деменція. Деякі люди можуть запам'ятовувати речі краще за інших.

        Багато причин проблем з пам’яттю можна усунути за допомогою правильної підтримки та лікування. Водночас за допомогою профілактики можна попередити чи відтермінувати погіршення пам’яті. На цій сторінці пояснюються причини погіршення пам’яті, як подбати про свою пам’ять та як впоратись із її погіршенням у себе чи іншої людини.`,

		menuSubTitle: [
			{
				SubMenuId: 1,
				SubMenuTitle: 'Основне про деменцію',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,
						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З віком люди, ймовірно, помічають деякі зміни у своїх розумових здібностях. Вони можуть включати наступні ситуації:
                            частіше проявляється забудькуватість, 
                            потрібно більше часу на запам'ятовування,
                            легше відволікатися,
                            важче робити кілька справ одночасно. 
                            
                            Це може стати помітним, особливо в середньому віці – зазвичай це 40, 50 і початок 60-х років.
                            
                            Хоча ці зміни можуть засмучувати, вони є природною частиною старіння. Багато людей хвилюються, що це ранні ознаки деменції. Для більшості людей це не так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція включає групу симптомів. Її спричиняють різні захворювання, які пошкоджують мозок.

                            Симптоми деменції з часом погіршуються і включають:
                            втрату пам'яті,
                            розгубленість та потребу в допомозі при виконанні щоденних завдань,
                            проблеми з мовою та розумінням,
                            зміни в поведінці.
                            
                            Коли людина має деменцію, це погіршення розумових здібностей набагато серйозніше, ніж звичайні зміни, які відбуваються з віком. 
                            
                            Спочатку зміни можуть бути незначними, але з часом вони стають все більш помітними. Щоб медичний працівник міг діагностувати деменцію, симптоми людини повинні суттєво впливати на її повсякденне життя. Це означає труднощі з виконанням повсякденних завдань по дому, в суспільстві або на роботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
			{
				SubMenuId: 2,
				SubMenuTitle: 'Стадії деменції',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,

						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З віком люди, ймовірно, помічають деякі зміни у своїх розумових здібностях. Вони можуть включати наступні ситуації:
                            частіше проявляється забудькуватість, 
                            потрібно більше часу на запам'ятовування,
                            легше відволікатися,
                            важче робити кілька справ одночасно. 
                            
                            Це може стати помітним, особливо в середньому віці – зазвичай це 40, 50 і початок 60-х років.
                            
                            Хоча ці зміни можуть засмучувати, вони є природною частиною старіння. Багато людей хвилюються, що це ранні ознаки деменції. Для більшості людей це не так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція включає групу симптомів. Її спричиняють різні захворювання, які пошкоджують мозок.

                            Симптоми деменції з часом погіршуються і включають:
                            втрату пам'яті,
                            розгубленість та потребу в допомозі при виконанні щоденних завдань,
                            проблеми з мовою та розумінням,
                            зміни в поведінці.
                            
                            Коли людина має деменцію, це погіршення розумових здібностей набагато серйозніше, ніж звичайні зміни, які відбуваються з віком. 
                            
                            Спочатку зміни можуть бути незначними, але з часом вони стають все більш помітними. Щоб медичний працівник міг діагностувати деменцію, симптоми людини повинні суттєво впливати на її повсякденне життя. Це означає труднощі з виконанням повсякденних завдань по дому, в суспільстві або на роботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
		],
	},
	{
		menuTitle: 'Що таке деменція?2',
		id: 2,
		shortContent:
			'Що таке деменція, як поставити діагноз і як зменшити ризик розвитку деменції або відстрочити її вплив.',
		linkUrl: '/Що таке деменція',
		contentLight: `Кожна людина час від часу може щось забувати, і зазвичай це нормально. Але якщо проблеми з пам’яттю впливають на ваше повсякденне життя, краще звернутися до лікаря загальної практики.

        Втрата пам'яті є однією з поширених ознак деменції, яка виникає унаслідок захворювань, що пошкоджують роботу мозку. Це пошкодження часто вражає ділянки мозку, які беруть участь у створенні нових спогадів і запам’ятовуванні старих. Однак деменція може проявлятися й через інші симптоми, що можуть виникати раніше за погіршення пам'яті, зокрема дезорієнтація, депресія тощо.`,
		contentDark: `Погіршення пам’яті не обов’язково означає, що у вас деменція. Деякі люди можуть запам'ятовувати речі краще за інших.

        Багато причин проблем з пам’яттю можна усунути за допомогою правильної підтримки та лікування. Водночас за допомогою профілактики можна попередити чи відтермінувати погіршення пам’яті. На цій сторінці пояснюються причини погіршення пам’яті, як подбати про свою пам’ять та як впоратись із її погіршенням у себе чи іншої людини.`,

		menuSubTitle: [
			{
				SubMenuId: 1,
				SubMenuTitle: 'Основне про деменцію',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,
						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З віком люди, ймовірно, помічають деякі зміни у своїх розумових здібностях. Вони можуть включати наступні ситуації:
                            частіше проявляється забудькуватість, 
                            потрібно більше часу на запам'ятовування,
                            легше відволікатися,
                            важче робити кілька справ одночасно. 
                            
                            Це може стати помітним, особливо в середньому віці – зазвичай це 40, 50 і початок 60-х років.
                            
                            Хоча ці зміни можуть засмучувати, вони є природною частиною старіння. Багато людей хвилюються, що це ранні ознаки деменції. Для більшості людей це не так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція включає групу симптомів. Її спричиняють різні захворювання, які пошкоджують мозок.

                            Симптоми деменції з часом погіршуються і включають:
                            втрату пам'яті,
                            розгубленість та потребу в допомозі при виконанні щоденних завдань,
                            проблеми з мовою та розумінням,
                            зміни в поведінці.
                            
                            Коли людина має деменцію, це погіршення розумових здібностей набагато серйозніше, ніж звичайні зміни, які відбуваються з віком. 
                            
                            Спочатку зміни можуть бути незначними, але з часом вони стають все більш помітними. Щоб медичний працівник міг діагностувати деменцію, симптоми людини повинні суттєво впливати на її повсякденне життя. Це означає труднощі з виконанням повсякденних завдань по дому, в суспільстві або на роботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
			{
				SubMenuId: 2,
				SubMenuTitle: 'Стадії деменції',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,

						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З віком люди, ймовірно, помічають деякі зміни у своїх розумових здібностях. Вони можуть включати наступні ситуації:
                            частіше проявляється забудькуватість, 
                            потрібно більше часу на запам'ятовування,
                            легше відволікатися,
                            важче робити кілька справ одночасно. 
                            
                            Це може стати помітним, особливо в середньому віці – зазвичай це 40, 50 і початок 60-х років.
                            
                            Хоча ці зміни можуть засмучувати, вони є природною частиною старіння. Багато людей хвилюються, що це ранні ознаки деменції. Для більшості людей це не так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція включає групу симптомів. Її спричиняють різні захворювання, які пошкоджують мозок.

                            Симптоми деменції з часом погіршуються і включають:
                            втрату пам'яті,
                            розгубленість та потребу в допомозі при виконанні щоденних завдань,
                            проблеми з мовою та розумінням,
                            зміни в поведінці.
                            
                            Коли людина має деменцію, це погіршення розумових здібностей набагато серйозніше, ніж звичайні зміни, які відбуваються з віком. 
                            
                            Спочатку зміни можуть бути незначними, але з часом вони стають все більш помітними. Щоб медичний працівник міг діагностувати деменцію, симптоми людини повинні суттєво впливати на її повсякденне життя. Це означає труднощі з виконанням повсякденних завдань по дому, в суспільстві або на роботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
		],
	},
	{
		menuTitle: 'Що таке деменція?3',
		id: 3,
		shortContent:
			'Що таке деменція, як поставити діагноз і як зменшити ризик розвитку деменції або відстрочити її вплив.',
		linkUrl: '/Що таке деменція',
		contentLight: `Кожна людина час від часу може щось забувати, і зазвичай це нормально. Але якщо проблеми з пам’яттю впливають на ваше повсякденне життя, краще звернутися до лікаря загальної практики.

        Втрата пам'яті є однією з поширених ознак деменції, яка виникає унаслідок захворювань, що пошкоджують роботу мозку. Це пошкодження часто вражає ділянки мозку, які беруть участь у створенні нових спогадів і запам’ятовуванні старих. Однак деменція може проявлятися й через інші симптоми, що можуть виникати раніше за погіршення пам'яті, зокрема дезорієнтація, депресія тощо.`,
		contentDark: `Погіршення пам’яті не обов’язково означає, що у вас деменція. Деякі люди можуть запам'ятовувати речі краще за інших.

        Багато причин проблем з пам’яттю можна усунути за допомогою правильної підтримки та лікування. Водночас за допомогою профілактики можна попередити чи відтермінувати погіршення пам’яті. На цій сторінці пояснюються причини погіршення пам’яті, як подбати про свою пам’ять та як впоратись із її погіршенням у себе чи іншої людини.`,

		menuSubTitle: [
			{
				SubMenuId: 1,
				SubMenuTitle: 'Основне про деменцію',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,
						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З віком люди, ймовірно, помічають деякі зміни у своїх розумових здібностях. Вони можуть включати наступні ситуації:
                            частіше проявляється забудькуватість, 
                            потрібно більше часу на запам'ятовування,
                            легше відволікатися,
                            важче робити кілька справ одночасно. 
                            
                            Це може стати помітним, особливо в середньому віці – зазвичай це 40, 50 і початок 60-х років.
                            
                            Хоча ці зміни можуть засмучувати, вони є природною частиною старіння. Багато людей хвилюються, що це ранні ознаки деменції. Для більшості людей це не так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція включає групу симптомів. Її спричиняють різні захворювання, які пошкоджують мозок.

                            Симптоми деменції з часом погіршуються і включають:
                            втрату пам'яті,
                            розгубленість та потребу в допомозі при виконанні щоденних завдань,
                            проблеми з мовою та розумінням,
                            зміни в поведінці.
                            
                            Коли людина має деменцію, це погіршення розумових здібностей набагато серйозніше, ніж звичайні зміни, які відбуваються з віком. 
                            
                            Спочатку зміни можуть бути незначними, але з часом вони стають все більш помітними. Щоб медичний працівник міг діагностувати деменцію, симптоми людини повинні суттєво впливати на її повсякденне життя. Це означає труднощі з виконанням повсякденних завдань по дому, в суспільстві або на роботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
			{
				SubMenuId: 2,
				SubMenuTitle: 'Стадії деменції',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,

						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З віком люди, ймовірно, помічають деякі зміни у своїх розумових здібностях. Вони можуть включати наступні ситуації:
                            частіше проявляється забудькуватість, 
                            потрібно більше часу на запам'ятовування,
                            легше відволікатися,
                            важче робити кілька справ одночасно. 
                            
                            Це може стати помітним, особливо в середньому віці – зазвичай це 40, 50 і початок 60-х років.
                            
                            Хоча ці зміни можуть засмучувати, вони є природною частиною старіння. Багато людей хвилюються, що це ранні ознаки деменції. Для більшості людей це не так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція включає групу симптомів. Її спричиняють різні захворювання, які пошкоджують мозок.

                            Симптоми деменції з часом погіршуються і включають:
                            втрату пам'яті,
                            розгубленість та потребу в допомозі при виконанні щоденних завдань,
                            проблеми з мовою та розумінням,
                            зміни в поведінці.
                            
                            Коли людина має деменцію, це погіршення розумових здібностей набагато серйозніше, ніж звичайні зміни, які відбуваються з віком. 
                            
                            Спочатку зміни можуть бути незначними, але з часом вони стають все більш помітними. Щоб медичний працівник міг діагностувати деменцію, симптоми людини повинні суттєво впливати на її повсякденне життя. Це означає труднощі з виконанням повсякденних завдань по дому, в суспільстві або на роботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
		],
	},
];
const dementiaMenu2: DementiaMenu[] = [
	{
		menuTitle: 'Що таке деменція?',
		id: 1,
		shortContent:
			'Що таке деменція, як поставити діагноз і як зменшити ризик розвитку деменції або відстрочити її вплив.',
		linkUrl: '/Що таке деменція',
		contentLight: `К тощо.`,
		contentDark: `Погіршення людини.`,

		menuSubTitle: [
			{
				SubMenuId: 1,
				SubMenuTitle: 'Основне про деменцію',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,
						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З це ранні ознаки деменції. Для більшості людей це не так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція  роботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
			{
				SubMenuId: 2,
				SubMenuTitle: 'Стадії деменції',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,

						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменціяроботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
		],
	},
	{
		menuTitle: 'Що таке деменція?2',
		id: 2,
		shortContent:
			'Що таке деменція, як поставити діагноз і як зменшити ризик розвитку деменції або відстрочити її вплив.',
		linkUrl: '/Що таке деменція',
		contentLight: `Кожна .`,
		contentDark: `Погіршення людини.`,

		menuSubTitle: [
			{
				SubMenuId: 1,
				SubMenuTitle: 'Основне про деменцію',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,
						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З  так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція роботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
			{
				SubMenuId: 2,
				SubMenuTitle: 'Стадії деменції',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,

						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З  так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція  роботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
		],
	},
	{
		menuTitle: 'Що таке деменція?3',
		id: 3,
		shortContent:
			'Що таке деменція, як поставити діагноз і як зменшити ризик розвитку деменції або відстрочити її вплив.',
		linkUrl: '/Що таке деменція',
		contentLight: `Кожна що.`,
		contentDark: `Погіршення людини.`,

		menuSubTitle: [
			{
				SubMenuId: 1,
				SubMenuTitle: 'Основне про деменцію',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,
						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З  так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція роботі.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
			{
				SubMenuId: 2,
				SubMenuTitle: 'Стадії деменції',
				SubMenuLinkUrl: '/dementia',
				SubMenuCards: [
					{
						cardTitle: '5 речей, які треба знати про деменцію',
						cardId: 1,

						cardLinkUrl: '/dementia',
						cardImg: '/images/dementia/5things.jpg',
						cardIntroduction: 'string',
						cardIntroductionTitle: 'string',
						cardText: [
							{
								cardTextTitle: 'Нормальні ознаки старіння',
								cardTextDescription: `'З  так.'`,
								cardTextId: 1,
							},
							{
								cardTextTitle:
									'Як деменція відрізняється від нормального перебігу старіння?',
								cardTextDescription: `Деменція ті.`,
								cardTextId: 2,
							},
						],
					},
				],
			},
		],
	},
];
export default async function handler(
	request: NextApiRequest,
	response: NextApiResponse
) {
	return response.status(200).json({ dementiaMenu });
}
